Repository: MrHyde-/school_wp_myProject
Catalog: aSkyImage/Resources/AppResources.*.resx
Languages: fi

# AlbumPageAppBarDownload
source: Download
fi: Lataa

# AlbumPageAppBarUpload
source: Upload
fi: Lähetä

# AlbumPageAppBarZoom
source: Zoom
fi: Tarkastele

# AlbumsPageAddNewAlbumsName
source: Please give your album a name
fi: Anna albumille nimi

# AlbumsPageAppBarAddAlbum
source: Add Album
fi: Lisää albumi

# AlbumsPageTitle
source: Your albums
fi: Albumit

# CommonPinToStart
source: Pin to start
fi: Kiinnitä aloitusnäyttöön

# CommonRefresh
source: Refresh
fi: Päivitä

# LoginPromptTitle
source: Session ended, please login
fi: Sessio vanhentunut, kirjaudu uudestaan

# LoginTitle
source: Login
fi: Kirjaudu sisään

# MainPageAppBarAlbums
source: Albums
fi: Albumit

# MainPageStatusLoadedAlbums
source: Loaded, move to albums
fi: Ladattu, siirry albumeihin

# MainPageStatusLoadingAlbums
source: Loading your albums..
fi: Ladataan albumeitasi..

# MainPageStatusPleaseLogin
source: Waiting login
fi: Odotetaan kirjautumista

# MainPageStatusTitle
source: Status
fi: Tila

# MainPageWelcomeInfo
source: Start browsing your SkyDrive albums and photos by login with your Microsoft credentials.
fi: Aloita SkyDrive albumien ja valokuvien selaaminen kirjautumalla sisään käyttämällä microsoft tiliäsi.

# MainPageWelcomeText
source: Welcome to aSkyImage!
fi: Tervetuloa aSkyImageen!

# MessageToUserAlbumCreated
source: New album created
fi: Uusi albumi luotu

# MessageToUserCommentAdded
source: New comment added to a photo
fi: Uusi kommentti lisätty

# MessageToUserDownloadingCompleted
source: Photo {0} downloaded to your phone.
fi: Kuva {0} ladattu puhelimeesi.

# MessageToUserImageUploaded
source: Image uploaded
fi: Kuva lähetetty.

# MessageToUserPleaseSelectPhotoFirst
source: Please select a photo first
fi: Valitse kuva ensin, ole hyvä.

# MessageToUserProblemsWithAlbum
source: Problem with selected album..
fi: Ongelmia valitun albumin kanssa..

# MessageToUserUploadingImageToAlbum
source: Uploading image to album: {0}
fi: Lähetetään kuva albumiin: {0}

# PhotoPageAddCommentTitle
source: Write your comment
fi: Kirjoita kommenttisi

# PhotoPageAppBarAddNewComment
source: Comment
fi: Lisää kommentti

# PhotoPageImageCommentingDisabled
source: Image not shared, go to your skydrive www to share the image.
fi: Kuvaa ei ole jaettu, siirry skydriven www sovellukseen muuttaakseeki kuvan jako asetuksia.

# PhotoPageImageHasNoComments
source: No comments.
fi: Ei kommentteja.

# PromptCancel
source: Cancel
fi: Peruuta

# TileExistsAlready
source: A tile exists already.
fi: Ohjelma on jo lukitusnäytöllä.
